package storage

import (
	"context"
	"fmt"
	"net"
	"strings"
	"time"

	"github.com/alextonkonogov/gb-go-observability/homework1/app/internal/config"

	"github.com/jackc/pgx/v4/pgxpool"
)

func InitDBConn(ctx context.Context, appConfig *config.AppConfig) (dbpool *pgxpool.Pool, err error) {
	url := "postgres://postgres:password@pg_db:5432/postgres?sslmode=disable"
	fmt.Println(url)

	cfg, err := pgxpool.ParseConfig(url)
	if err != nil {
		err = fmt.Errorf("failed to parse pg config: %w", err)
		return
	}

	cfg.MaxConns = int32(appConfig.MaxConns)
	cfg.MinConns = int32(appConfig.MinConns)
	cfg.HealthCheckPeriod = 1 * time.Minute
	cfg.MaxConnLifetime = 24 * time.Hour
	cfg.MaxConnIdleTime = 30 * time.Minute
	cfg.ConnConfig.ConnectTimeout = 1 * time.Second
	cfg.ConnConfig.DialFunc = (&net.Dialer{
		KeepAlive: cfg.HealthCheckPeriod,
		Timeout:   cfg.ConnConfig.ConnectTimeout,
	}).DialContext

	dbpool, err = pgxpool.ConnectConfig(ctx, cfg)
	if err != nil {
		err = fmt.Errorf("failed to connect config: %w", err)
		return
	}

	return
}

func InitTables(ctx context.Context, dbpool *pgxpool.Pool) (err error) {
	query := `create table if not exists users
				(
					id      bigint primary key generated always as identity,
					name    varchar(200) not null,
					surname varchar(200) not null,
					active  boolean      not null default true
				);
				
				create table if not exists motivations
				(
					id        bigint primary key generated always as identity,
					content     varchar(999) not null,
					author varchar(999) not null,
					user_id integer not null,
					constraint author_id_fkey foreign key (user_id) references users (id)
				);
				
				insert into users (name, surname)
				values ('Alex', 'Tonkonogov');
				
				insert into motivations (content, author, user_id) VALUES
					('А если ты не уверен в себе ничего хорошего никогда не получится. Ведь если ты в себя не веришь, кто же поверит?', 'Кто-то умный', 1),
					('Без идеи не может быть ничего великого! Без великого не может быть ничего прекрасного.', 'Гюстав Флобер', 1),
					('Быстрее всего учишься в трех случаях — до 7 лет, на тренингах, и когда жизнь загнала тебя в угол.', 'Стивен Кови', 1),
					('В вашем подсознании скрыта сила, способная перевернуть мир.', 'Уильям Джеймс', 1),
					('В моем словаре нет слова «невозможно».', 'Наполеон Бонапарт', 1),
					('Важно верить, что талант нам даётся не просто так – и что любой ценой его нужно для чего-то использовать.', 'Мари Кюри', 1),
					('Ваше время ограничено, не тратьте его, живя чужой жизнью', 'Стив Джобс', 1),
					('Велики те, кто видит, что миром правят мысли.', 'Ральф Эмерсон', 1),
					('Великие души обладают волей, слабые же имеют только желания.', 'Китайская пословица', 1),
					('Великие умы ставят перед собой цели остальные люди следуют своим желаниям.', 'Вашингтонг Ирвинг', 1),
					('Вместо того, чтобы сетовать, что роза имеет шипы, я радуюсь тому, что среди шипов растет роза.', 'Жозеф Жубер', 1),
					('Во-первых, не делай ничего без причины и цели. Во-вторых, не делай ничего, что бы не клонилось на пользу общества.', 'Марк Аврелий', 1),
					('Возникшие желания должны реализовываться безотлагательно. А то все удовольствие пропадает. Захотел – сделал, чего тянуть, жизнь коротка. Здесь и сейчас!', 'Михаил Веллер', 1),
					('Воин действует, а глупец протестует.', 'Мирный воин', 1),
					('Воин не отказывается от того, что любит. Он находит любовь в том, что делает.', 'Мирный воин', 1),
					('Вопрос не в том, кто мне разрешит, а в том, кто сможет мне запретить.', 'Айн Рэнд', 1),
					('Все дело в мыслях. Мысль — начало всего. И мыслями можно управлять. И поэтому главное дело совершенствования: работать над мыслями.', 'Лев Толстой', 1),
					('Все дети - художники. Проблема в том, чтобы остаться художником, когда ты вырос.', 'Пабло Пикассо', 1),
					('Все победы начинаются с победы над самим собой.', 'Леонид Леонов', 1),
					('Всегда выбирайте самый трудный путь - на нем вы не встретите конкурентов.', 'Шарль де Голль', 1),
					('Всегда опирайтесь на мысль о том, что ваше собственное решение добиться успеха намного важнее всего другого.', 'Авраам Линкольн', 1),
					('Всякая мысль подобна тесту, стоит помять ее хорошенько — все из нее сделаешь.', 'Иван Тургенев', 1),
					('Вы не будете расти, если не будете пытаться совершить что-то за пределами того, что вы уже знаете в совершенстве.', 'Ральф Эмерсон', 1),
					('Вы не должны сравнивать себя с другими, и если природа создала вас летучей мышью, вы не должны пытаться стать страусом.', 'Герман Гессе', 1),
					('Вы никогда не будете слишком стары для того. Чтобы поставить перед собой новую цель или мечтать о чем-то новом.', 'Клайв Стейплз Льюис', 1),
					('Вы никогда не пересечете океан, если не наберетесь мужества потерять берег из виду.', 'Христофор Колумб', 1),
					('Вы никогда не сумеете решить возникшую проблему, если сохраните то же мышление и тот же подход, который привел вас к этой проблеме.', 'Альберт Эйнштейн', 1),
					('Вы хотите знать кто вы? Не спрашивайте. Действуйте! Действие будет описывать и определять вас.', 'Томас Джефферсон', 1),
					('Выживает не самый сильный, а самый восприимчивый к переменам.', 'Чарльз Дарвин', 1),
					('Главное – отдать все силы избранному делу и от вас пойдет молва. Ибо совершенство – редкость.', 'Андре Моруа', 1),
					('Говорят, что мотивация длится недолго. Что ж, свежесть после ванны – тоже. Поэтому заботиться о них стоит ежедневно.', 'Зиг Зиглар', 1),
					('Даже если вы очень талантливы и прилагает большие усилия, для некоторых результатов просто требуется время: вы не получите ребенка через месяц, даже если заставите забеременеть девять женщин.', 'Уоррен Баффет', 1),
					('Два самых важных дня в твоей жизни: день, когда ты появился на свет, и день, когда понял, зачем.', 'Марк Твен', 1),
					('Два самых важных дня в твоей жизни: день, когда ты появился на свет, и день, когда понял, зачем.', 'Марк Твен', 1),
					('Делай все, что можешь, там, где ты находишься, используя все, что имеешь.', 'Теодор Рузвельт', 1),
					('Делай сегодня то, что другие не хотят, завтра будешь жит так, как другие не могут.', 'Кто-то умный', 1),
					('Делай, что можешь, с тем, что у тебя есть, и там, где ты находишься.', 'Теодор Рузвельт', 1),
					('Делайте дела с теми людьми, которые вам нравятся и которые разделяют ваши цели.', 'Уоррен Баффет', 1),
					('Для нас не должно существовать никаких пределов.', 'Ричард Бах', 1),
					('Единственное счастье в жизни — это постоянное стремление вперед.', 'Эмиль Золя', 1),
					('Единственный способ сделать что-то очень хорошо – любить то, что ты делаешь.', 'Стив Джобс', 1),
					('Если вам предлагают место в ракетоносителе, не спрашивайте, что за место! Просто займите его.', 'Шерил Сэндберг, операционный директор Facebook', 1),
					('Если внутренний голос говорит вам, что вы не можете рисовать – рисуйте как можно больше, тогда этот голос затихнет.', 'Винсент Ван Гог', 1),
					('Если вы думаете о том, что имеете в жизни, вы всегда сможете иметь больше. Если же вы считаете, чего у вас нет, вам никогда не будет достаточно.', 'Опра Уинфри', 1),
					('Если вы думаете, что на что-то способны, вы правы если думаете, что у вас ничего не получится - вы тоже правы.', 'Генри Форд', 1),
					('Если вы откажитесь от своей мечты, то что оcnанется?', 'Джим Керри', 1),
					('Если вы хотите иметь успех, вы должны выглядеть так, как будто вы его имеете.', 'Томас Мор', 1),
					('Если вы цените то, что у вас есть в жизни, вы всегда будете получать еще больше. Если думать лишь о том, чего у вас нет – вам никогда не будет достаточно.', 'Опра Уинфри', 1),
					('Если нет ветра, беритесь за вёсла.', 'Латинская поговорка', 1),
					('Если останавливаться всякий раз, когда тебя оскорбляют или в тебя плюются, то ты никогда не дойдешь до места, куда тебе надо попасть.', 'Тибор Фишер', 1),
					('Если тебе не нравится то, что ты получаешь, измени то, что ты даешь.', 'Карлос Кастанеда', 1);`

	requests := strings.Split(query, ";")

	for _, v := range requests {
		strings.TrimSpace(v)
		if v != "" {
			_, err = dbpool.Exec(ctx, v)
			if err != nil {
				return
			}
		}
	}

	return
}
